# 1)მოცემულია სია --> [1, 2, 3, 4, 5, 6]
# შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].

num = [1, 2, 3, 4, 5, 6]
num[2:4] = [10, 20, 30]
print(num)


# 2)მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
# შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].

bannanaa = ["apple", "banana", "cherry", "kiwi", "mango"]
bannanaa[:2] = ["pear", "plum"]
print(bannanaa)


# 3)ოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
# შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].

unc = ["a", "b", "c", "d", "e", "f"]
unc[-3:] = ["x", "y", "z"]
print(unc)


# 4)მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
# შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].

red = ["red", "green", "blue", "yellow", "black", "white"]
red[2:5] = ["purple", "orange"]
print(red)


# 5)მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
# შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]

kirka = ["გიორგი", "ირმა", "საბა"]
kirka[:] = ["red", "green", "blue", "yellow", "black", "white"]
print(kirka)


# ===========================================

# 6) მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი , თუ ლუწია დაპრინტე --> "Even" ,თუ კენტია დაპრინტე --> "Odd".

num = int(input("put number:"))

if num % 2 == 0:
    print("Even")
else:
    print("Odd")


# 7)შექმენი სია --> სადაც შეინახავ ინტეჯერებს ,შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არუს ლუწი დაპრინტე --> "Even number" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"

ricxvebi = [69, 21, 2, 6, 84, 120]

if ricxvebi[3] % 2 == 0:
    print("Even number")
else:
    print("Odd number")


# 8)შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე --> "ეს რიცხვი არის ლუწი და მეტი 50 ზე" , თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე --> "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"

integ_ricxvebi = [2200, 34, 21, 68, 67, 84, 202, 102, 30421, 200, 1772, 2006, 20, 25, 80082]
bolo = integ_ricxvebi[-1]

if bolo % 2 == 0 and bolo > 50:
    print("ეს რიცხვი არის ლუწი და მეტი 50 ზე")
elif bolo % 2 != 0 and bolo < 50:
    print("ეს რიცხვი არის კენტი და ნაკლები 50 ზე")


# 9)შექმენი სია სადაც შეინახავ ინტეჯერებს,თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე --> "even or more than 100" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> odd or less than 100

gowi = [2200, 34, 21, 300, 67, 84, 202, 102, 30421, 200, 1772, 2006, 20, 25, 80082]

if gowi[5] % 2 == 0 or gowi[5] > 100:
    print("even or more than 100")
else:
    print("idk about this number")

if gowi[3] % 2 != 0 or gowi[3] < 100:
    print("odd or less than 100")
else:
    print("idk about this number")


# ==============================================================

# 10)შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს , შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს , გამოიყენე ახლად ნასწავლი ოპერატორი != 

a = "gultgontxarta"
b = "gultgontxarta"

if a != b:
    print("arao ar udris ertmanetso")
else:
    print("vauuu tolia ertmanetis")