# 1)მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ  ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც

print(5 + 3)
print(123 + 99999999999)
print(7 + 2)

print(10 - 4)
print(20 - 5)
print(100 - 30)

print(6 * 3)
print(9 * 9)
print(5 * 12)

print(15 / 3)
print(67 / 69)
print(50 / 5)

print(17 // 5)
print(45 // 3)
print(100 // 9)

print(17 % 5)
print(100 % 9)
print(45 % 8)

print(2 ** 3)
print(3 ** 4)
print(5 ** 2)

# 2)კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინო
# + <-- დამატება
# - <-- გამოკლება
# * <-- გამრავლება
# / <-- გაყოფა
# // <-- გაყოფის შედეგად იღებს მხოლოდ მთელ ციფრს
# % <-- ეს ყოფს რიცხვს და გვიპრინტავს ნაშთს
# ** <-- აყავს რიცხვი ხარისხში

# 3)დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , ანუ სულ 15 მაგალით უნდა გქონდეთ

print(10 // 3)
print(100 // 7)
print(25 // 4)
print(9 // 2)
print(30 // 5)

print(2 ** 3)
print(3 ** 2)
print(5 ** 3)
print(10 ** 2)
print(4 ** 4)

print(10 % 3)
print(100 % 7)
print(25 % 4)
print(9 % 2)
print(30 % 5)

# 4)ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:
# 15 / 3 = 5
#20 / 4 = 5
#100 / 20 = 5

#15 // 10 = 1
#10 // 7 =1
#40 // 12 = 3

#4 * 3 = 12
#40 * 3 = 120
#120 * 3 = 360

#4 ** 3 = 64
#10 ** 3 = 1000
#2 ** 6 = 64
#3 ** 4 = 81

#10 % 7 = 3
#3 % 2 = 1
#50 % 25 = 0
#14 % 11 = 3
#110 % 50 = 10

# 5)კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს,და რით განსხვავდებიან ისინი ცვლადებისაგან

# სიები  გვაძლევენ საშუალებას ერთ ცვლადში ერთზე მეტი მონაცემი შევინახოთ ხოლო ჩვეულებრივ ცვლადში შეგვიძლია მარტო აერთი მონაცემის შენახვა

# 6)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები

random_words = ["apple" , "galaxydestroyer" , "death star" , "mirage" , "v-tec civic"]

# 7)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები

num_list = [1 , 2 , 3]

# 8)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები

float_list = [6.9 , 6.7 , 1.20 , 20000.90374]

# 9)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები

bool_list = [True , False]

# 10)შექმენით სია,შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი

mixed_list = ["hello",6967, 96.69, True]

# 11)მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები(თან დაპრინტეთ რომ ნახოთ შედეგი)

num1 = int(input("Enter first number: "))
num2 = int(input("Enter sec number: "))

print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)
print(num1 // num2)
print(num1 % num2)
print(num1 ** num2)

# 12)მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი რიცხვი არის 30 ზე მეტი და 100ზე ნაკლები დაუპრინტე --> "between 30 and 100", თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე --> "between 100 and 200" , სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number"

number = int(input("put any number: "))

if 30 < number < 100:
    print("between 30 and 100")
elif 100 < number < 200:
    print("between 100 and 200")
else:
    print("other number")

# 13)შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები(გამოიყენეტ ნასწავლი ფუნქცია)

int = 10
float = 3.14
str = "text"
boolean = True
list = [1, 2, 3]

print(type(int))
print(type(float))
print(type(str))
print(type(boolean))
print(type(list))

# 14)while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60 ...

num = 50
while num <= 100:
    print(num)
    num = num + 5

# 15)for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 ...

for i in range(40, 91, 3):
    print(i)

# 16)გამოიტანე შენი სახელი და გვარი 15 ჯერ,გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით

for i in range(15):
    print("davit karalashvili")
# --------------------------------------
i = 0
while i < 15:
    print(".davit karalashvili")
    i = i + 1

# 17)შექმენი ცვლადი სადაც შეინახავ შენს სახელს
# შექმენი ცვლადი სადაც შეინახავ შენს გვარს
# მომხმარებელს შემოატანინეთ სახელი
# თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
#       მომხმარებელს შემოატანინე გვარი
#       თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
#             დაპრინტე --> same name and surname
#       სხვა შემთხვევაში
#             დაპრინტე -- > same name but different surname
# სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
#     დაპრინტე --> aqedan moshordi

my_name= "davit"
my_surname = "karalashvili"

user = input("Enter your name: ")

if user == my_name:
    user_surname = input("Enter your surname: ")
    if user_surname == my_surname:
        print("same name and surname")
    else:
        print("same name but different surname")
else:
    print("aqedan moshordi")

# 18)შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი


password = "Da.20.04.2006.to"

while True:
    password_guess = input("password: ")
    if password_guess == password:
        print("Correct! You guessed it.")
        break
    else:
        print("Wrong password, try again.")




