# 1)ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True
print(5 > 2 and 10 == 10)           # True
print(3 == 4 or 2 == 2)             # True
print(7 > 1 and 8 == 8)             # True
print(100 < 200 or 50 == 50)        # True
print(6 > 3 and 9 < 15)            # True

print(5 > 10 and 3 < 4)             # False
print(2 == 2 and 7 == 9)            # False
print(1 > 2 or 3 < 1)               # False
print(8 == 8 and 100 < 50)          # False
print(0 > 1 or 9 < 5)               # False
# 2)
# Sequencing — ნიშნავს როდესაც კოდი იკითხება ზემოდან ქვემოთ თანმიმდევრობით.

# Iteration — ნიშნავს გამეორებას, იგივე ციკლს.

# Selection — ნიშნავს არჩევანის გაკეთებას.

# 3)მოიყვანე secuencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence
x = 10
y = 20
z = x + y
print(z)
# 4)კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის
# for loop — არის ციკლი, რომელიც გამოიყენება ელემენტების კოლექციაში (მაგ. სიაში, დიაპაზონში) გასავლელად.
# ის გვეხმარება ერთი და იგივე კოდის მრავალჯერ შესრულებაში, რაც ამცირებს ხელით კოდის გამეორებას.

# 6)შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop
car = "corvet c5"
for i in range(5):
    print(car)

# 7)შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ
surname = "karalashvili"
for i in range (100):
    print(surname)

# 8)შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ
color = "red"
for i in range(46):
    print(color)

# 9)
