# 1) მომხმარებელს შემოატანინეთ სიტყვა და დაპრინტეთ თუ ამ სიტყვაში რამდენი ასო მეორდება ზუსტად 2-ჯერ, მაგალითად: თუ მომხმარებელმა შემოიტანა სიტყვა "Niiooookkaa", ამ სიტყვაში ჩვენ გვაქვს სამი ასო რომელიც სიტყვაში ზედიზედ ზუსტად 2-ჯერ მეორდება: ii, kk, aa, ამიტომ უნდა დავპრინტოთ 3. არ გამოიყენოთ count ფუნქცია, არ დაგეზაროთ!

word = input("შეიყვანე სიტყვა: ")

datvla = 0

for i in range(len(word) - 1):
    if word[i] == word[i + 1]:
        if i == 0 or word[i] != word[i - 1]:
            if i + 2 == len(word) or word[i] != word[i + 2]:
                datvla += 1
print(datvla)
# 2) მომხმარებელს შემოატანინეთ სტრინგი რომელშიც იქნება ასოებიც და რიცხვებიც, მაგალითად - "G3lkij6m7m844", ჩვენი დავალებაა რომ დავპრინტოთ ამ სტრინგში მყოფი რიცხვების ჯამი. დღეს ვისწავლეთ მაგრამ ამ დავალებაში არ გამოიყენოთ split() ფუნქცია.

text = input("შეიყვანე სტრინგი: ")

mteli = 0

for i in text:
    if i.isdigit():
        mteli += int(i)

print(mteli)

# 3) მომხმარებელს შემოატანინეთ წინადადება რომელიც იწყება რამდენიმე სფეისით, ცარიელი ადგილებით, და ყოველ სიტყვებს შორის იყოს ერთის მაგივრად რამდენიმე ცარიელი ადგილი, და წინადადება ასევე დამთავრდეს რამდენი სფეისით, მაგალითად: "    I    love    Python    ". თქვენი დავალებაა რომ დაპრინტოთ მომხმარებლის მოცემული წინადადება ჩვეულებრივი, ერთ-ერთი სფეისების გამოტოვებით, ამ შემთხვევაში ასე - "I love Python".

sentence = input("შეიყვანე წინადადება: ")

result = ""
i = 0

while i < len(sentence):

    if sentence[i] != " ":
        result = result + sentence[i]
        i = i + 1
    else:
        if result != "" and result[-1] != " ":
            result = result + " "

        while i < len(sentence) and sentence[i] == " ":
            i = i + 1

if result != "" and result[-1] == " ":
    result = result[:-1]

print(result)

# 4) შექმენით რიცხვებით სავსე სტრინგი, თქვენი დავალებაა დაითვალოთ და დაპრინტოთ თუ რამდენი რიცხვი არის მის უკან მდგომ რიცხვზე დიდი. მაგალითად თუ გვაქვს მოცემული სია - [1, 3,  2, 4, 6, 5], 3 > 1, 4 > 2, 6 > 4, გამოდის რომ გვაქვს ასეთი 3 რიცხვი, დავპრინტავთ მათ რაოდენობას, 3-ს.
# 5) მომხმარებელს შემოატანინეთ სტრინგ ტიპის მონაცემი და დაპრინტეთ ყველაზე მეტჯერ ზედიზედ რამდენი ასო მეორდება. მაგალითად: მომხმარებელმა შემოიტანა სტრინგი "aaabbccccdaa", a ასო კი მეორდება 5-ჯერ, მაგრამ არ მეორდება ზედიზედ, ამიტომ მას არ ვთვლით. ზედიზედ ყველაზე მეტჯერ მეორდება ასო c, მეორდება 4-ჯერ, ამიტომ ვპრინტავთ რიცხვ 4-ს.