# 1)კომენტარის სახით ახსენით თუ რა არის index და რაში ვიყენებთ მას

# index არის ელემენტის ადგილმდებარეობა .მას ვიყენებთ იმისთვის, გამოვიყენოთ კონკრეტული ელემენტი. 

#==========================================================================================================

# 2)შექმენით ცვლადი სადაც შეინახავთ ამ სიას [4,6,1,5,9,8,4] ,თქვენი დავალებაა რომ მიწვდეთ ამ სიაში ელემენტებს ინდექსინგის გამოყენებით ,შეკრიბეთ ორი რიცხვი რომ მიიღთ შემდეგი რიცხვები --> 10 , 2 , 14 , 20 , 4 , 7 , 27 , გამოიყენეთ მათემატიკური ოპერატოები

numbers = [4, 6, 1, 5, 9, 8, 4]

print(numbers[0] + numbers[1])
print(numbers[2] + numbers[2])
print(numbers[4] + numbers[3])
print(numbers[4] + numbers[5] + numbers[6] - numbers[2])
print(numbers[5] - numbers[6])
print(numbers[1] + numbers[2])
print(numbers[4] + numbers[1] + numbers[3] + numbers[1] + numbers[2])

#===========================================================================================================

# 3)შექმენით სია სადაც შეიყვანთ ადამიანის სახელებს,უნდა გქონდეთ სულ 10 სახელი,თქვენი დავალებაა რომ გამოიტანოტ ,მე 5 , მე 9 ,მე 3 ,მე 7 და პირველ ინდექსზე მდგომი ელემენტები ცალ ცალკე,გამოიყენეთ ინდექსინგი

names = ["lela", "shmagi", "luka", "nini", "Mari", "DAvita", "geluka", "nikusha", "tato", "toko"]

print(names[1])
print(names[3])
print(names[5])
print(names[7])
print(names[9])

#===========================================================================================================

# 4)შექმენით სია სადაც მოათავსებთ სტრინგ ტიპის მონაცემებს,თქვენი დავალებაა გომ for loop და while loop (ორივე) ს დახმარებით გამოიტანოთ თთოეული ელემენტი ცალ ცალკე

cars = ["BMW", "Tesla", "ford transit", "kamazi", "lada"]

for i in range(5):
    print(cars[i])

#============================================================================================================

num = 0

while num < 5:
    print(cars[num])
    num +=1

#=============================================================================================================

# 5)შექმენით სია სადაც შეინახავთ 7 ცალ ელემენტს(მონაცემის ტიპს არ აქვს მნიშვნელობა),თქვენი დავალებაა რომ ამ სიაში შეცვალოთ მე 3 ინდექსზე დმგომი ელემენტი და ჩაანაცვლო "vashli" ით, ასევე შეცვალე მე 6 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე 'msxali' ით ,ასევე შეცვალე მე 4 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე ის 'atami" ით,გამოიტანე საბოლოო სია ტერმინალში,სადაც ეს სალი ელემენტი იქნება განახლებული~

items = ["gela", "tavshi mogxvda pianino", "gelashvili", "dada", "ar mowio bioi", "rogoa xar", "nice"]

items[3] = "vashli"
items[6] = "msxali"
items[4] = "atami"

for i in range(7):
    print(items[i])

#==============================================================================================================

# 6)იპოვეთ საბოლოო პასუხი--> True and False or False and True or false and false or true ---> ...

#True იქნება პასუხი

print(True and False or False and True or False and False or True)

#===============================================================================================================

# 7)შექმენით სია სადაც მოთავსებული გექნებათ ცხოველების სახელები, თქვენი დავალებაა რომ -->  თუ ამ სიაში მოთავსებული მე 3 ინდექსზე მდგომი ელემენტი არის ლომი მაშნ დაპრინტე --> "there is lion on index 3" სხვა შემთხვევაში დაუპრინტე რომ --> "there is no lion on index 3"

animals = ["kata", "dzagli", "dzroxa", "lion", "datunia druncha"]

if animals[3] == "lion":

    print("there is lion on index 3")

else:

    print("there is no lion on index 3")


#=================================================================================================================

# 8)basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

# დაბეჭდეთ კალათის პირველი ხილი.

# დაბეჭდეთ კალათის მესამე ხილი.

# შეცვალეთ მეორე ხილი "ბანანი" სხვა ხილით (თქვენი არჩევანით).

# დაბეჭდეთ თავიდან ბოლომდე ყველა ხილი ცალ–ცალკე, ინდექსების გამოყენებით (არა for-ით)

basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

print(basket[0])
print(basket[2])
basket[1] = "მანდარინი" 
print(basket[0])
print(basket[1])
print(basket[2])
print(basket[3])
print(basket[4])

#====================================================================================================================

# 9)letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

# დაბეჭდეთ მესამე ასო.

# დაბეჭდეთ მე–5 და მე–6 ასო.

# დაბეჭდეთ ბოლო ასო.

# ააწყეთ სიტყვა "მამა" ინდექსებით (ყველა ასო ინდექსით უნდა აიღონ და შეაერთონ).

# ააწყეთ სიტყვა "გოლა".

# ააწყვეთ სიტყვა "გოგა"

letters = ["a", "b", "g", "o", "l", "a", "m", "a", "t", "e"]

print(letters[2])
print(letters[4], letters[5])
print(letters[9])

print(letters[6] + letters[0] + letters[6] + letters[7])

print(letters[2] + letters[3] + letters[4] + letters[5])

print(letters[2] + letters[3] + letters[2] + letters[5])

#======================================================================================================================

# 10)letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

# აიღეთ მე–4 ინდექსზე არსებული ასო და შეინახე ცვლადში

# თუ ეს ასო არის "ლ", დაბეჭდეთ: "სწორია! ასო ლ ა"

# სხვა შემთხვევაში დაბეჭდეთ: "არასწორია, სცადე თავიდან"

# =========================
# აიღეთ ბოლო ასო და შეინახე ცვლადში

# თუ ეს "ე"–ა, დაბეჭდეთ "საიდუმლო სიტყვა იწყება სწორად".

# სხვა შემთხვევაში – "საიდუმლო სიტყვა არასწორია".
# ==========================

# ააწყვეთ სიტყვა "გელა" და შეინახე ცვლადში 

# თუ ცვლადში შენახული სიტყვა "გელა"–ს ტოლია, დაბეჭდეთ "გაარტყი სახელი!"

# სხვა შემთხვევაში – "შტერი ხარ!დ".


letters = ["a", "b", "g", "o", "L", "a", "m", "a", "t", "e"]

letter = letters[4]

if letter == "L":

    print("True it is L")

else:

    print("wrong try again")

#======================================================================

lastletter = letters[9]

if lastletter == "e":

    print("secret letter stars with it")

else:

    print("secret name is wrong")

#======================================================================

word = letters[2] + letters[9] + letters[4] + letters[5]

if word == "geLa":

    print("you are right!")

else:

    print("you are stupid")


# 11)შექმენი სია რომელიც იქნება სტრინგებით სავსე,შენი დავალებაა რომ მომხმარებელს შემოატანინო რაიმე რიცხვი,შენი დავალებაა რომ ამ სიიდან გამოიტანო მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი

str = ["mamuka" , "BMW" , "LOL" , "hidroeleqtrosadguri" , "yveli" , "hipermarketi" , "whats 9 + 10?" , "21" , "you stupid"]


while True:
    index = int(input("put any number from 0 to 8 :"))

    if index >= 0 and index <= 8:
        print("you chose:", str[index])
        break
    else:
        print("pleas choose from 0 to 8")