# ```
# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

saxeli = input("ra gqvia?: ")
print(saxeli.upper())

# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით

gvari = input("gtxov sheiyvano sheni gvari didi asoebit: ")
print(gvari.lower())

# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი

zedmetsaxeli = input("gvitxari sheni zedmetsaxeli: ")
print(zedmetsaxeli.capitalize())

# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით

megobrebi = ["davita", "bidzina", "margoi", "mixo"]
for i in megobrebi:
    print(i.upper())

# 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით

GANG = ["DAVITA", "BIDZINA", "MARGOI", "MIXOI"]
for i in GANG:
    print(i.lower())

# 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს
fantazia = ["hate", "mate", "trigger", "nicer", "better"]  #saxelebi mezareba
for i in fantazia:
    print(i.capitalize())

# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს

sia = ["xoda", "gela", "midioda", "magaziashi", "gadmouxta", "veluri", "ixvi", "dakla", "shewva", "shewama", "dawva", "daidzina"]
print(len(sia))

# 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს

random = "xoda ro daidzina ra gaigvidza dilaze gaiara shexvda igive ixvi xodaaa opaaa axla damerxao"
print(len(random))

# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

# for loopitaa ricxvebi da magitoa am sigrdze xelit mezareboda wera

ricxvebi = [ 0
, 1
, 2
, 3
, 4
, 5
, 6
, 7
, 8
, 9
, 10
, 11
, 12
, 13
, 14
, 15
, 16
, 17
, 18
, 19
, 20
, 21
, 22
, 23
, 24
, 25
, 26
, 27
, 28
, 29
, 30
, 31
, 32
, 33
, 34
, 35
, 36
, 37
, 38
, 39
, 40
, 41
, 42
, 43
, 44
, 45
, 46
, 47
, 48
, 49
, 50
, 51
, 52
, 53
, 54
, 55
, 56
, 57
, 58
, 59
, 60
, 61
, 62
, 63
, 64
, 65
, 66
, 67
, 68
, 69
, 70
, 71
, 72
, 73
, 74
, 75
, 76
, 77
, 78
, 79
, 80
, 81
, 82
, 83
, 84
, 85
, 86
, 87
, 88
, 89
, 90
, 91
, 92
, 93
, 94
, 95
, 96
, 97
, 98
, 99
, 100]
satvalavi = 0

for i in ricxvebi:
    if i % 2 == 0:
        satvalavi += 1

print("da am siashi luwi ricxvebis raodenobaaaaaa :", satvalavi)  

# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა

ricxvebi = [ 0
, 1
, 2
, 3
, 4
, 5
, 6
, 7
, 8
, 9
, 10
, 11
, 12
, 13
, 14
, 15
, 16
, 17
, 18
, 19
, 20
, 21
, 22
, 23
, 24
, 25
, 26
, 27
, 28
, 29
, 30
, 31
, 32
, 33
, 34
, 35
, 36
, 37
, 38
, 39
, 40
, 41
, 42
, 43
, 44
, 45
, 46
, 47
, 48
, 49
, 50
, 51
, 52
, 53
, 54
, 55
, 56
, 57
, 58
, 59
, 60
, 61
, 62
, 63
, 64
, 65
, 66
, 67
, 68
, 69
, 70
, 71
, 72
, 73
, 74
, 75
, 76
, 77
, 78
, 79
, 80
, 81
, 82
, 83
, 84
, 85
, 86
, 87
, 88
, 89
, 90
, 91
, 92
, 93
, 94
, 95
, 96
, 97
, 98
, 99
, 100]
satvalavi = 0

for i in ricxvebi:
    if i % 2 != 0:
        satvalavi += 1

print("da am siashi kenti ricxvebis raodenobaaaaaa :", satvalavi)  


# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები
# ```

start = int(input("yvelaze dabali cifri rac mogafiqrdes: "))
end = int(input("rame magali riccxviii:  "))
step = int(input("random number must be 0-10"))

for i in range(start, end, step):
    if i % 2 == 0:
        print(i)