
# 1) შექმენით 10 ელემენტიანი სია, და ამ სიიდან ბოლო 5 ელემენტი გამოიტანეთ დადებითი სლაისინგით

list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

list = list_1[5:10]

print(list)

# 2) შექმენით 20 ელემენტიანი სია, და ამ სიიდან პირველი 11 ელემენტი გამოიტანეთ ყაროფიტითი ინდექსებით

list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 , 11 , 12 , 13 , 14 , 15 , 16 , 17, 18, 19, 20]

pirveli_11_ricxvi = list_1[-20:-9]

print(pirveli_11_ricxvi)

# 3) შექმენით 12 ელემენტიანი სია, და მომხარებელს შემოატანინე რიცხვი, შემდეგ 2 იდან მომხარებლის შემოტანილ რიცხვამდე გამოიტანე ყველა ელემენტი

list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 , 11 , 12]

number = int(input("put number from 2-12:"))

user = list_1[2:number]

print(user)


