# 1) შექმენით წინადადების სტრინგის ცვლადი, ამ ცვლადში დაითვალეთ ხმოვანი ასოების რაოდენობა. გამოიყენეთ for ციკლი.

winadadeba = "At that moment I was the most fearsome weasel in the entire swamp."
xmovani = "aeiouAEIOU"
tvla = 0

for i in winadadeba:
    if i in xmovani:
        tvla += 1

print(tvla)

# 2) შექმენით რიცხვებით სავსე სია და დაითვალეთ ამ სიაში მყოფი მხოლოდ ლუწი რიცხვების ჯამი, გამოიყენეთ for ციკლი.

num = [1, 2, 3, 4, 5, 6, 8,9,10 ,11 , 12, 13, 14, 15, 16, 17, 18, 19, 20]
datvla = 0

for i in num:
    if i % 2 == 0:
        datvla += i

print(datvla)

# 3) შექმენით რიცხვებით სავსე სია, გაიგეთ რომელი რიცხვი არის ამ სიაში ყველაზე დიდი, გამოიყენეთ for ციკლი, არ გამოიყენოთ max() ფუნქცია.

num1 = [3, 7, 2, 9, 5]
didi = num1[0]

for i in num1:
    if i > didi:
        didi = i

print(didi)

# 4) მომხმარებელს შემოატანინეთ პაროლი, თუ პაროლის სიგრძე არის 6-ზე ნაკლები, მაშინ თავიდან შემოატანინეთ ახალი პაროლი, როცა პაროლის სიგრძე იქნება 6 ან 6-ზე მეტი, გააჩერეთ ციკლი და დაპრინტეთ "Your password is correct!" გამოიყენეთ while ციკლი.

password = input("paroli")

while len(password) < 6:
    password = input("pataraa xelaxla chawere: ")

print("kaia")
# 5) შექმენით რიცხვებით სავსე  სია რომელშიც რამდენიმე რიცხვი მეორდება და დაპრინტეთ სია გამეორებების გარეშე, აუცილებლად იგივე თანმიმდევრობით. მაგალითად: თუ მოცემული გვაქვს სია [3, 5, 3, 8, 5, 10, 8], მაშინ ჩვენ უნდა დავპრინტოთ [3, 5, 8, 10]  გამოიყენეთ for ციკლი.

num3 = [7, 3, 3, 9, 9, 120, 130, 120, 130]
num2 = []

for i in num3:
    if num2.count(i) == 0:
        num2.append(i)

print(num2)

# 6) მომხმარებელს შემოატანინეთ წინადადება და ტერმინალში ყველა ახალ ხაზზე დაპრინტეთ ამ წინადადების სიტყვა და რიცხვი თუ რამდენჯერ მეორდება ეს სიტყვა წანადადებაში. მაგალითად: თუ მოცემული გვაქვს წინადადება "Hello I love apples Hello", მაშინ ტერმინალში ჯერ უნდა გამოვიდეს Hello 2, რადგან ეს სიტყვა 2-ჯერ მეორდება წინადადებაში, შემდეგ ხაზზე უნდა ეწეროს I 1, შემდეგ love 1, და ბოლოს apples 1. გამოიყენეთ სიები, არ გამოიყენოთ count() ფუნქცია.



# ბატონი ნიკოლოზ წერეთელი:second_place: :second_place_medal: — 1/16/2026 10:07 PM
# 7) შექმენით რაიმე რიცხვის ცვლადი და მომხმარებელს შემოატანინეთ რიხვი, მომხმარებელმა უნდა შეეცადოს რომ გამოიცნოს ჩვენი რიცხვი, თუ მისი შემოტანილი რიცხვი არ უდრის ჩვენს რიცხვს, მაშინ ისევ თავიდან შემოატანინეთ მანამ სანამ არ გამოიცნობს. როცა ჩვენს რიცხვს გამოიცნობს, დაპრინტეთ თუ რამდენი ცდა მოუწია მანამ სანამ გამოიცნო, მაგალითად: "Correct! Attempts: 10" გამოიყენეთ while ციკლი.