# ```
# 1)კომენტარის სახით ჩამოწერე თითეული სიის ფუნქცია რაც ვისწავლეთ და მიუწერეთ გვერდით ახსნა განმარტება თუ რა გადაეცემა თითეულს და რას აკეთებს ის

# 1) append() - ამ ფუნქციის მეშვეობით ჩვენ ვამატებთ ახალ ელემენტს სსიის ბოლოში

# 2) insert() - ამ ფუნქციის მეშვეობით ჩვენ შეგვიძლია კონკრეტულ ადგილას ჩავამატოთ ელემენტი

# 3) pop() - ამ ფუნქციას ვიყენებთ სიის ბოლო ელემენტის ამოსაშლელად  ან გვერძე ინდექსი თუ მივუწერეთ იმ ინდექსზე მდგომ ელემენტს ამოშლის

# 4) remove() - ამ ფუნქსიას შეუძლია მოაშოროს ამოაგდოს სიის ელემენტი pop ისგან იმით განსხვავდება რომ ციფრის მაგივრად უნდა ჩავწეროთ თვითონ ელემენტი რომელიც გვინდა რო ამოვშალოთ

# 2)შექმენი რიცხვების სია.
# append() ფუნქციით დაამატე მასში რიცხვი 10 ბოლოში.
# დაბეჭდე სია რომ ნახო ჩაემატა თუ არა

ციფრები = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 20, 40, 20 ,9302]
ციფრები.append(10)
print(ციფრები)

# 3)შექმენი სახელების სია.
# append() ფუნქციით დაამატე შენი სახელი სიის ბოლოში
# დაბეჭდე სია.

ოჯახი = ["ბიდზაცჰემი", "მიხეილი", "და" , "პაპაჩემი" , "ვაჟა" , "ასევე" , "მე"]
ოჯახი.append("დავითა")
print(ოჯახი)

# 4)შექმენი სია სადაც შეიყვან სახელებს,შენიდავალებაა მომხმარებელს შემოატანინო რაიმე სახელი და შეინახო ცვლადში,შემდეგ ჩაამატე append()ის დახმარებით სიის ბოლოში მომხმარებლის შემოტანილი სიტყვა ~
# დაბეჭდე სია რომნახო ჩაემატა თუ არა

ოჯახი = ["ბიდზაცჰემი", "მიხეილი", "და" , "პაპაჩემი" , "ვაჟა" , "ასევე" , "მე"]
აგერ_დედაჩემი = input("დედას ქვია:")
ოჯახი.append(აგერ_დედაჩემი)
print(ოჯახი)

# 5)შექმენი სია სადაც შეიყვანთ 5 სახეკს
# .insert() დახმარებით სიაში ჩაამატე მესამე ინდექსზე შენი სახელი

რამე = ["ტომასი", "დიმა", "ბიზინა", "გელა", "ნათელა", "ლუკითო"]
რამე.insert(3, "დავითააა")
print(რამე)

# 6)მომხმარებელს შემოატანინე სახელი და რიცხვი(integer 0 იდან 6 ჩათვლით)
# შენი დავალებაა შექმნა სია მინიმუმ 6 ელემენტიანი
# insert() დახმარებით დაამატე სიაში მომხმარებლის მიერ შემოტანილი რიცხვი,მომხმარებლის მიერ შემოტანილ ინდექსზე
# მაგ:მომხმარებელმა სახელი შემოიტანა საბა და რიცხვი 4 , შენი დავალებაა რომ საბა დაამატო მეოთხე ინდექსზე(გამოიყენე ცვლადის სახელები იმიტომ რომ არ იცი მომხმარებელი რა მნშვნელობებს შემოიტანს
# დაბეჭდე სია რომ ნახო ჩაემატა თუ არა

სახელი = [ 1 , "რანდომ", 3 , "ინსერტ", 5 , "რამე"]
მე = input("შეიყვანე სახელი: ")
რიცხბი = int(input("შეიყვანე რიცხვი 1-6 ის ჩათვლით: "))
სახელი.insert(რიცხბი, მე)
print(სახელი)

# 7)შექმენი სია:

# fruits = ["apple", "banana"]

# insert() ფუნქციით ჩასვი "orange" 1 ინდექსზე.

fruits = ["apple", "banana"]
fruits.insert(1, "orange")
print(fruits)

# 8)შექმენი სია:

# names = ["goga", "saba", "luka"]

# insert()-ით ჩასვი "irakli" ბოლოს წინა პოზიციაზე ანუ ლუკას წინ

names = ["goga", "saba", "luka"]
names.insert(2, "irakli")
print(names)

# 9)შექმენი სია:

# foods = ["bread", "milk", "cheese"]

# insert() ფუნქციით ჩასვი "water" სიის დასაწყისში.

foods = ["bread", "milk", "cheese"]
foods.insert(0, "water")
print(foods)

# 10)შექმენი სია:numbers = [5, 10, 15]

# pop() ფუნქციით წაშალე ბოლო ელემენტი და დაბეჭდე განახლებული სია.

numbers = [5, 10, 15]
numbers.pop()
print(numbers)

# 11)შექმენი სია:

# fruits = ["apple", "banana", "orange"]


# pop -ით ამოშალე "banana" და დაბეჭდე დარჩენილი სია.

fruits = ["apple", "banana", "orange"]
fruits.pop(1)
print(fruits)

# 12)შექმენი სია:

# names = ["goga", "saba", "luka"]

# ამოშალე "saba" pop()-ით  — შემდეგ დაბეჭდე სია რომ ნახო ამოიშალა თუ არა

names = ["goga", "saba", "luka"]
names.pop(1)
print(names)

# 13)შექმენი სია:

# colors = ["red", "green", "blue" , "yellow" , "black" , "purple"]

# pop()-ით წაშალე "red" და დაბეჭდე განახლებული სია.

# შემდეგ სიიდან ასევე ამოშალე yellow

# დაბეჭდე სია და ნახე შედეგი

colors = ["red", "green", "blue" , "yellow" , "black" , "purple"]
colors.pop(0)
print(colors)
colors.pop(3)
print(colors)

# 14)მომხმარებელს შემოტანინე რიცხვი(0 იდან 4 მდე და შეინახე ცვლადში

# შექმენი სია tems = ["pen", "pencil", "book", "eraser"] 

# pop ის დახმარებით სიიდან ამოშალე მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი

tems = ["pen", "pencil", "book", "eraser"]
cvladi= int(input("chawere ricxvi 1-4 amde:"))
tems.pop(cvladi)
print(tems)

# 15)შექმენი სია:

# fruits = ["apple", "banana", "orange"]

# remove() ფუნქციით სიისდან წაშალე "banana".

# დაბეჭდე სია ნახე ამოიშალა თუ არა

fruits = ["apple", "banana", "orange"]
fruits.remove("banana")
print(fruits)

# 16)შექმენი სია:

# nums = [3, 5, 3, 7]


# remove()-ით წაშალე 3 და დააკვირდი, მხოლოდ პირველი 3 იანი შაიშლება.

# დაბეჭდე სია რომ დარწმუნდე

nums = [3, 5, 3, 7]
nums.remove(3)
print(nums)

# 17)შექმენი სია:

# colors = ["red", "blue", "green"]


# remove() ფუნქციით წაშალე "blue" და დაბეჭდე განახლებული სია.

colors = ["red", "blue", "green"]
colors.remove("blue")
print(colors)

# 18)შექმენი სია:

# names = ["goga", "saba", "luka"]


# მომხმარებელს შემოატანინე ამ სამიდან რომელიმე სახელი შეინახე ცვლადში და remove()-ით წაშალე მომხმარებლის შემოტანილი სახელი სიიდან.

# დაბეჭდე სია რომ გაიგო მართლა ამოიშალა თუ არა

names = ["goga", "saba", "luka"]
random = input("goga, saba, luka, am samidan chawere nebismieri:")
names.remove(random)
print(names)

# 19)შექმენი სია:

# items = ["pen", "pencil", "book", "pencil"]


# remove()-ით წაშალე "pencil" და დაბეჭდე დარჩენილი სია.

items = ["pen", "pencil", "book", "pencil"]
items.remove("pencil")
print(items)