# 1) შექმენით რიცხვებით სავსე სია და ახალ სიაში ჩააგდეთ ყველა რიცხვი გამრავლებული 2-ზე. დაპრინტეთ ახალი სია.
num = [1, 2, 3, 4, 5]
arr1 = []

for i in num:
    arr1.append(i * 2)

print(arr1)
# 2) შექმენით სახელებით სავსე სია, მომხმარებელს შემოატანინეთ რაიმე რიცხვი, და ამ რიცხვის ინდექსზე ჩაამატეთ სახელი "ნიკა" თქვენს სიაში.

names = ["goga", "lukinioo", "davita", "gelaaa"]
index = int(input("put index: "))

names.insert(index, "nika")

print(names)

# 3) შექმენით string წინადადების ცვლადი, ამ წინადადებიდან დაპრინტეთ მხოლოდ ხმოვანი ასოები.

sentence = "რაც მოგივა დავითაო, ყველა შენი თავითაო"
vowels = "აეიოუ"

for char in sentence:
    if char in vowels:
        print(char)

# 4) შექმენით სტრინგებით სავსე სია, წაშალეთ ის სტრინგ მონაცემთა ტიპის ელემენტები რომლებიც არიან 4-ზე მეტი სიგრძეში ან დგანან კენტ ინდექსზე. გამოიყენეთ remove() ფუნქცია.

arr = ["gela", "mamuka", "ai is", "ai ia", "ki", "ratomac ara", "ara", "hidroeleqtrosadguri"]

i = 0
while i < len(arr):
    if len(arr[i]) > 4 or i % 2 == 1:
        arr.remove(arr[i])
    else:
        i += 1

print(arr)


# 5) შექმენით რიცხვებით სავსე სია, გამოითვალეთ რიცხვების საშუალო არითმეტიკული - რიცხვების ჯამი გაყოფილი რიცხვების რაოდენობაზე.

