# 1) შექმენი სია 7 რიცხვით.

# დაბეჭდე პირველი და ბოლო ელემენტების ნამრავლი ისე, რომ ორივეჯერ უარყოფითი ინდექსი გამოიყენო.

# დაბეჭდე მესამე ელემენტი მარცხნიდან და მესამე ელემენტი მარჯვნიდან (უარყოფითიინდექსის გამოყენებით).


nums = [ 8 , 4 , 2 , 6 , 11 , 12 , 24 ]

print(nums[-7] , nums[-1])

print(nums[-5])
print(nums[-3])

# ==========================================================================================================================

# 2) შექმენი სია "apple", "banana", "cherry", "grape", "kiwi", "orange" .  დაბეჭდე შუა 2 ელემენტი (ორივე(დადებითი და უარყოფითი)) ინდექსით.

fruits = ["apple", "banana", "cherry", "grape", "kiwi", "orange"]

print(fruits[2])
print(fruits[-5])
print(fruits[3])
print(fruits[-3])

# ===========================================================================================================================

# 3) შექმენი [3,4,5,6,7,1,2,9,8,11]

# მომხმარებელს შემოატანინე ერთი ინდექსი(რიცხვი) 0 დან 10 მდე.

# თუ მომხმარებლის ინდექსი დადებითია → დაბეჭდე ის ელემენტი

# თუ უარყოფით რიცხვი ან  10 ზე მეტი მაღალირიცხვი შემოიყვანა დაბეჭდეთ --> "you entered negative or more than 10  number "

arr = [3,4,5,6,7,1,2,9,8,11]

index = int(input("put any index:"))

if index > 0 and index < 10:
    print(arr[index])
else:
    print( "you entered negative or more than 10  number ")
    
# =================================================================================================================================

# 4) შექმენით სია ["dog" ," most" ,"is" ,"angry" ,"running"  , "forest", "fast", "in" , "cat" ,"human", "very"]


# --- მინუს ინდექსების გამოყენებით შეადგინეთ შემდეგი წინადადება და დაბეჭდეთ --> "dog is running in forest very fast"

# --- აასწყვეთ ზემოთ მოცემული წინადადება ოღონდ დადებითი ინდექსებით

# --- დადებით ინდექსების გამოყენებით ააწყვეთ შემდეგი წინადადება ---> "cat is very angry"

words = ["dog", "most", "is", "angry", "running", "forest", "fast", "in", "cat", "human", "very"]

pirveli_winadadeba = words[-11] + " " + words[-9] + " " + words[-7] + " " + words[-4] + " " + words[-6] + " " + words[-1] + " " + words[-5]

print(pirveli_winadadeba)

meore_winadadeba = words[0] + " " + words[2] + " " + words[4] + " " + words[7] + " " + words[5] + " " + words[10] + " " + words[6]

print(meore_winadadeba)

mesame_winadadeba = words[8] + " " + words[2] + " " + words[10] + " " + words[3]

print(mesame_winadadeba)

# =====================================================================================================================

# 5)შექმენი სია ცხოველებით: ["dog", "cat", "horse", "cow", "sheep", "goat"].

# მომხმარებელს შემოიტანინე ინდექსი(რიცხვი)

# თუ მომხმარებლის მიერ შემოყვანილ ინდექსზე მდგომი ელემენტი არის  "cat", დაბეჭდე "შენ აირჩიე კატა".

# თუ არის "goat", დაბეჭდე "შენ აირჩიე თხა".

# სხვა შემთხვევაში დაბეჭდე "სხვა ცხოველი აირჩიე".

animals = ["dog", "cat", "horse", "cow", "sheep", "goat"]

index = int(input("put index 0-5): "))

if animals[index] == "cat":
    print("შენ აირჩიე კატა")

elif animals[index] == "goat":
    print("შენ აირჩიე თხა")

else:
    print("სხვა ცხოველი აირჩიე")

#===================================================================================================================

# 6)შექმენი სია 6 ქალაქით.
# მომხმარებელი შემოიტანს ორ ინდექსს(რიცხვს).

# თუ პირველი ინდექსი ნაკლებია მეორეზე → დაბეჭდე ამ ინდექსებზე მდგომი ორივე ელემენტი.

# თუ მეორე ნაკლებია პირველზე → დაბეჭდე "შეცვალე ინდექსები ადგილებით"--->ზემოთ თუ დაპრინტე a და b ამ შემთხვევაში დაპრინტე b და a.

# თუ ინდექსები ერთნაირია → დაბეჭდე "ორივე ერთია" და გამოიტანე ამ ინდექსზე მდგომი ელემენტი ვთქვათ თუ შემოიყვანა მომხმარებელმა 5 და 5 დაუბეჭდე მე 5 ინდექსზე მდგომი ელემენტი.

qalaqebi = ["tbilisi", "ureki", "qutaisi", "rustavi", "gurjaani", "gori"]

index1 = int(input("put index 0-5: "))
index2 = int(input("put index 0-5: "))

if index1 < index2:
    print(qalaqebi[index1], qalaqebi[index2])

elif index2 < index1:
    print("შეცვალე ინდექსები ადგილებით")
    print(qalaqebi[index2] , qalaqebi[index1])

else:
    print("ორივე ერთია")
    print(qalaqebi[index1])

# -=====================================================================================================

# 7)მომხმარებელი შემოიტანს სიტყვას.

# თუ პირველი ასო "a"-ა → დაბეჭდე "სიტყვა იწყება a-თი".

# თუ ბოლო ასო "z"-ია → დაბეჭდე "სიტყვა მთავრდება z-ით".

# სხვაგვარად → დაბეჭდე "სიტყვა არც a-თი იწყება და არც z-ით მთავრდება".

word = input("word: ")

if word[0] == "a":
    print("სიტყვა იწყება a-თი")

elif word[-1] == "z":
    print("სიტყვა მთავრდება z-ით")

else:
    print("სიტყვა არც a-თი იწყება და არც z-ით მთავრდება")

# =========================================================================================================

# 8)დავალება 4

# მომხმარებელი შემოიტანს სიტყვას.

# თუ პირველი და ბოლო ასო ერთმანეთს ემთხვევა → დაბეჭდე "პირველი და ბოლო ერთნაირია".

# თუ განსხვავდება → "პირველი და ბოლო განსხვავებულია".

word = input("word: ")

if word[0] == word[-1]:
    print("პირველი და ბოლო ერთნაირია")

else:
    print("პირველი და ბოლო განსხვავებულია")

#]==============================================================================================================

# 9)შექმენი ცვლადი სადაც შეინახავთ შემდეგ ასოებს ---> "agivorsbgitr"
 
# ----ამ სიიდან შეადგინე სიტყვა "goga, 

# ----ამ სიტყვიდან შეადგინე სიტყვა "saba"

# ----ამ სიტყვიდან შეადგინე სიტყვა "bativar"

asoebi = "agivorsbgitr"

word1 = asoebi[1] + asoebi[-8] + asoebi[-4] + asoebi[0]
print(word1)

word2 = asoebi[-6] + asoebi[0] + asoebi[-5] + asoebi[0]
print(word2)

word3 = asoebi[-5] + asoebi[0] + asoebi[-2] + asoebi[2] + " " + asoebi[3] + asoebi[0] + asoebi[-1]
print(word3)

#==========================================================================================================

# 10)შექმენი შემდეგი სტრინგი --> 'giorgi'

# შენი დავალებააა რომ for დდა while loop ის დახმარებით გამოიტანო ამ სტრინგის თითეული ასო ცალ ცალკე

name = "giorgi"

for i in range(6):
    print(name[i])

i = 0
while i < 6:
    print(name[i])
    i += 1

