# 1) შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
# --> გამოიტანეთ პირველი 5 ელემენტი
# --> გამოიტანეთ ბოლო 3 ელემენტი
# --> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით

list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print(list[0:5])

print(list[7:])

print(list[3:8])


# 2) შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
# --> გამოიტანეთ პირველი 6 ელემენტი
# --> გამოიტანეთ ბოლო 10 ელემენტი
# --> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)

list2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

print(list2[-15:-9])

print(list2[-10:])

print(list2[7:15])

print(list2[-8:])


# 3) მოცემულია სიტვა 'თვითმფრინავი'
# გამოიტანეთ 'ნავი'

sityva = 'თვითმფრინავი'

print(sityva[-4:])


# 4) მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
# --> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით

sityva2 = 'Programmer'

print(sityva2[0:3])

print(sityva2[:-7])


# 5) შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:
# --> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)
# --> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)

kviris_dgeebi = ["orshabati", "samshabati", "otxshabati", "xutshabati", "paraskevi", "shabati", "kvira"]

print(kviris_dgeebi[0:5])

print(kviris_dgeebi[:-2])

print(kviris_dgeebi[5:])

print(kviris_dgeebi[-2:])

# 6) მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->
# გამოიტანეთ: 
# 'Python'
# 'slicing'
# 'powerful'
# გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსები

arvici = 'Python slicing is very powerful'         #-30 +26

print(arvici[0:6])

print(arvici[-31:-25])

print(arvici[7:14])

print(arvici[-24:-17])

print(arvici[23:])

print(arvici[-8:])
