# აყავს ხარისხში რიცხვი ** ოპერატორს

print(2 ** 3)
print(5 ** 2)
print(10 ** 0)

# % ყოფს რიცხვს და გვიპრინტავს ნაშთს

print(200 % 34)   # 1
print(223 % 24)    # 1
print(15 % 67)   # 0

# ჩვეულებრივ ყოფს რიცხვ მაგრამ float ის მაგივრად აბრუნებს integers
#ანუ ათწილადის  მაგივრად აბრუნებს მთელ რიცხვს

print(67 // 2) 
print(10 // 3)  
print(2 // 3) 


# --------------------------------


# ცვლადის ენიჭება ერთი მნიშვნელობა მაგალითად age = 25 
# list არის ისეთი ცვლადი სადაც შეგვიძლია შევინახოთ ერთზე მეტი მნიშჰვნელობა მაგ num=[42 , 'dato' , 3.5 ]
# ანუ მათ შორის ის განსხვავებაა რომ  ერთს მარტო ერთ მნიშჰჰვნელობას ინახავს მეორე ბევრს
 
list=[42 , 20.14 , True , "davit karalashvili"]

print(list)