# 1) for ციკლით დაბეჭდე რიცხვები 1 დან 50 მდე.  
#    თუ რიცხვი ლუწია -> დაბეჭდე "ლუწი"
#    თუ კენტია -> "კენტი"  
#    ფორმატით:  
#    1 კენტია  
#    2 ლუწია

for i in range(1, 50):
    if i % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")
  
# 2) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    - თუ რიცხვი იყოფა 3-ზე -> "იყოფა 3-ზე"  
#    - თუ რიცხვი იყოფა 5-ზე -> "იყოფა 5-ზე"  
#    - თუ ორივეზე იყოფა -> "იყოფა 3-ზე და 5-ზე" 
#    - სხვაგვარად -> "არ იყოფა არცერთზე"

for i in range(0, 20):
    if i % 3 == 0:
        print("იყოფა 3-ზე")
    elif i % 5 == 0:
        print("იყოფა 5-ზე")
    elif i % 5 == 0 and i % 3:
        print("იყოფა 5-ზე და 3-ზე")
    else:
        print("არ იყოფა არცერთზე")

# 3) მომხმარებელს შემოატანინე რიცხვი. 
#    for ციკლით დაითვალე რამდენი ლუწი და რამდენი კენტი რიცხვია დიაპაზონში 0-დან შემოტანილ რიცხვამდე.  
#    დაბეჭდე შედეგი ამ ფორმატით:  
#    ლუწი რიცხვების რაოდენობა: X  
#    კენტი რიცხვების რაოდენობა: Y

ციფრი = int(input("შეიყვანე რიცხვი: "))
x = 0
y = 0

for i in range():
    if i % 2 == 0:
        x += 1
    else:
        y += 1

print("ლუწი რიცხვების რაოდენობა:" , x)
print("კენტი რიცხვების რაოდენობა:" , y)

# 4) მოცემულია სია -> [10, 25, 33, 47, 80, 99]  
#    for ციკლით დაუარე თითოეულ ელემენტს.  
#    თუ ელემენტი მეტია 50 ზე -> "მეტი 50-ზე" 
#    თუ ნაკლებია 50 ზე -> "ნაკლები 50-ზე".

ricxvebi = [10, 20, 30, 50, 60, 100]

for i in range(6):
    if ricxvebi[i] >= 50:
        print(ricxvebi[i], "მეტი 50-ზე ან უდრის")
    else:
        print(ricxvebi[i], "ნაკლები 50-ზე")

# 5) for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 0 დან 100 მდე.  
#    ბოლოს დაბეჭდე -> "ლუწი რიცხვების ჯამია: X".

ჟიმშერი = 0
for i in range(0, 100):
    if i % 2 == 0:
        print(i)
        ჟიმშერი += 1
print("ლუწი რიცხვების ჯამია:", ჟიმშერი)

# 6) შექმენი სია და შეინახეთ შიგნით სტრინგები  
#    for ციკლით დაბეჭდე მხოლოდ ის სიტყვები, რომლებიც იწყება ასო "a" ზე.

word = ["gela", "jimsheri", "dzagli", "ar vici", "hmm hidravlika", "sazamtro"]

for i in range(6):
    if word[i][0] == "a":
        print(word[i])

# 7) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    თუ რიცხვი არის ნული -> "ნულია"  
#    თუ კენტია -> "კენტია"  
#    თუ ლუწია -> "ლუწია".

for i in range(0, 20):
    if i == 0:
        print("ნულია")
    elif i % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")

# 8) შექმენი სია -> [5, 15, 25, 35, 45, 55] 
#    for ციკლით დაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც იყოფა 5 ზე.

ricxvebi = [5, 15, 25, 35, 45, 55]

for i in range(6):
    if ricxvebi[i] % 5 == 0:
        print(ricxvebi[i])


# 9) მომხმარებელს შემოატანინე სიტყვა.  
#    for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

word = input("შეიყვანე სიტყვა: ")

for i in range():
    print(word[i])

# 10) შექმენი ცვლადი -> total = 0  
#     for ციკლით დაამატე 1 დან 10 მდე ყველა რიცხვი total-ში.  
#     ბოლოს დაბეჭდე -> "ჯამი არის: X".

total = 0

for i in range(1, 10):
    total += i

print("ჯამი არის:", total)


